app/controllers/rides_controller.rb

  def index
    render json: Ride.all
---
SELECT "rides".* FROM "rides"